Revit 2027 API
AlignmentStationLabel.CreateSet Method
 Creates a collection of AlignmentStationLabel objects along with their underlying SpotDimension elements.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<AlignmentStationLabel> CreateSet(
	Alignment alignment,
	View view,
	AlignmentStationLabelSetOptions options
)
Public Shared Function CreateSet (
	alignment As Alignment,
	view As View,
	options As AlignmentStationLabelSetOptions
) As ICollection(Of AlignmentStationLabel)
public:
static ICollection<AlignmentStationLabel^>^ CreateSet(
	Alignment^ alignment,
	View^ view,
	AlignmentStationLabelSetOptions^ options
)
static member CreateSet :
        alignment : Alignment *
        view : View *
        options : AlignmentStationLabelSetOptions -> ICollection<AlignmentStationLabel>
Parameters
alignment Alignment
The alignment on which the alignment station label is placed.
view View
The view for which the alignment station label is created.
options AlignmentStationLabelSetOptions
The alignment station options of the label set to be created.
Return Value
ICollection<AlignmentStationLabel>
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace